Catalogs/Заказ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>Заказ</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерСтола</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИтоговаяСуммаЗаказа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Официант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Заказ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Название</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаЗаЕд</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Заказ/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЗаказКоличествоПриИзменении(Элемент)
	ТаблицаЗаказов = Элементы.Заказ.ТекущиеДанные;
	ТаблицаЗаказов.Сумма = ТаблицаЗаказов.Количество*ТаблицаЗаказов.ЦенаЗаЕд;
	Объект.ИтоговаяСуммаЗаказа = Объект.Заказ.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ЗаказЦенаЗаЕдПриИзменении(Элемент)
	ТаблицаЗаказов = Элементы.Заказ.ТекущиеДанные;
	ТаблицаЗаказов.Сумма = ТаблицаЗаказов.Количество*ТаблицаЗаказов.ЦенаЗаЕд;
	Объект.ИтоговаяСуммаЗаказа = Объект.Заказ.Итог("Сумма");
КонецПроцедуры


&НаКлиенте
Процедура ЗаказСуммаПриИзменении(Элемент)
	ТаблицаЗаказ=Элементы.Заказ.ТекущиеДанные;
	ТаблицаЗаказ.Сумма=ТаблицаЗаказ.Количество*ТаблицаЗаказ.ЦенаЗаЕд;
	Объект.ИтоговаяСуммаЗаказа = Объект.Заказ.Итог("Сумма");
КонецПроцедуры
